//=============================================================================
//
// render_manager.h
// Author : shoto fukuoka
//
//=============================================================================
#ifndef _RENDER_MANAGER_H_
#define _RENDER_MANAGER_H_

//*****************************************************************************
// インクルード
//*****************************************************************************
#include <list>

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class Renderer;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class RenderManager
{
	std::list<Renderer*>			m_listRenderer;

public:

	//コンストラクタ
	RenderManager();

	//デストラクタ
	virtual ~RenderManager();

	//追加
	void AddRenderer(Renderer* renderer);

	//削除
	void DeleteRenderer(const Renderer* renderer);

	//全描画
	void DrawAll(void);
};

#endif
